export const questionsData = [
  {
    question: "А когда с человеком может произойти дрожемент?",
    answers: [
      "Когда он влюбляется",
      "Когда он идет шопиться",
      "Когда он слышит смешную шутку",
      "Когда он боится, пугается",
    ],
    correctAnswer: 3,
    explanation:
      "Лексема «дрожемент» имплицирует состояние крайнего напряжения и страха: «У меня всегда дрожемент в ногах, когда копы подходят».",
  },
  {
    question: "Говорят, Антон заовнил всех. Это еще как понимать?",
    answers: [
      "Как так, заовнил? Ну и хамло. Кто с ним теперь дружить-то будет?",
      "Антон очень надоедливый и въедливый человек, всех задолбал",
      "Молодец, Антон, всех победил!",
      "Нет ничего плохого в том, что Антон тщательно выбирает себе друзей",
    ],
    correctAnswer: 2,
    explanation:
      "Термин «заовнить» заимствован из английского языка, он происходит от слова own и переводится как «победить», «завладеть», «получить».",
  },
  {
    question: "А фразу «заскамить мамонта» как понимать?",
    answers: [
      "Разозлить кого-то из родителей",
      "Увлекаться археологией",
      "Развести недотепу на деньги",
      "Оскорбить пожилого человека",
    ],
    correctAnswer: 2,
    explanation:
      "Заскамить мамонта — значит обмануть или развести на деньги. Почему мамонта? Потому что мошенники часто выбирают в жертвы пожилых людей (древних, как мамонты), которых легко обвести вокруг пальца.",
  },
  {
    question: "Кто такие бефефе?",
    answers: [
      "Вши?",
      "Милые котики, такие милые, что бефефе",
      "Лучшие друзья",
      "Люди, которые не держат слово",
    ],
    correctAnswer: 2,
    explanation:
      "Бефефе — это лучшие друзья. Этакая аббревиатура от английского выражения best friends forever.",
  },
];
